In [1]:
import pandas as pd

In [2]:
ls

anaconda3/    Downloads/          Main-Projects/     nltk_data/     snap/
assgn1.ipynb  eclipse/            mongo_backup_3_6/  Pictures/      Templates/
Desktop/      eclipse-workspace/  mongodb-crud-app/  Public/        Videos/
Documents/    examples.desktop    Music/             seaborn-data/

In [8]:

import os
os.getcwd()

'/home/csl-4'

In [9]:
os.listdir()

['Music',
 '.gnupg',
 '.eclipse',
 '.config',
 '.nvm',
 'assgn1.ipynb',
 '.vscode',
 'examples.desktop',
 'mongo_backup_3_6',
 '.local',
 'seaborn-data',
 'Public',
 '.bash_history',
 '.ICEauthority',
 'Videos',
 '.mongodb',
 '.p2',
 '.swt',
 '.gphoto',
 '.pki',
 'archive.zip',
 '.bashrc',
 '.viminfo',
 'Pictures',
 '.dotnet',
 '.gvfs',
 '.condarc',
 '.cache',
 'eclipse',
 '.mozilla',
 'eclipse-workspace',
 '.thunderbird',
 '.sudo_as_admin_successful',
 '.conda',
 'anaconda3',
 '.ipynb_checkpoints',
 '.pam_environment',
 '.ssh',
 'Templates',
 'Main-Projects',
 'Downloads',
 'Desktop',
 '.anaconda',
 '.mongorc.js',
 '.dbus',
 '.keras',
 '.gnome',
 'nltk_data',
 'Documents',
 '.jupyter',
 'snap',
 '.npm',
 'mongodb-crud-app',
 '.python_history',
 '.dbshell',
 '.ipython',
 '.continuum']

### Method 1: Dataset Loaded from Kaggle (ZIP Download)
The dataset was downloaded from Kaggle in ZIP format, extracted, and loaded using Pandas.

In [11]:
import pandas as pd

df_kaggle = pd.read_csv("/home/csl-4/archive.csv")
 
df_kaggle.head()

,id,title,original_language,release_date,vote_average,vote_count,popularity,overview,genre_ids,Genres
0,278,The Shawshank Redemption,en,1994-09-23,8.706,26840,150.307,Imprisoned in the 1940s for the double murder ...,"[18, 80]","['Drama', 'Crime']"
1,238,The Godfather,en,1972-03-14,8.690,20373,122.973,"Spanning the years 1945 to 1955, a chronicle o...","[18, 80]","['Drama', 'Crime']"
2,240,The Godfather Part II,en,1974-12-20,8.575,12291,94.204,In the continuing saga of the Corleone crime f...,"[18, 80]","['Drama', 'Crime']"
3,424,Schindler's List,en,1993-12-15,8.565,15695,74.615,The true story of how businessman Oskar Schind...,"[18, 36, 10752]","['Drama', 'History', 'War']"
4,389,12 Angry Men,en,1957-04-10,8.546,8522,54.678,The defense and the prosecution have rested an...,[18],['Drama']

### Method 2: Dataset Loaded Directly Using URL

In this method, a dataset was imported directly into the Jupyter Notebook from an online source using its URL and the Pandas library.

In [12]:
import pandas as pd

url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv"

df_url = pd.read_csv(url)
df_url.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [13]:
df_url.shape
df_url.columns
df_url.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### Method 3: Manually Created Dataset

In this method, a custom dataset was created manually using Python data structures and converted into a Pandas DataFrame.

In [14]:
import pandas as pd

data = {
    "Student_ID": [1, 2, 3, 4, 5],
    "Name": ["Amit", "Riya", "Suresh", "Neha", "Rahul"],
    "Marks": [78, 85, 69, 90, 72],
    "Attendance": [92, 88, 75, 95, 80]
}

df_custom = pd.DataFrame(data)
df_custom

   Student_ID    Name  Marks  Attendance
0           1    Amit     78          92
1           2    Riya     85          88
2           3  Suresh     69          75
3           4    Neha     90          95
4           5   Rahul     72          80

In [15]:
df_custom.shape
df_custom.describe()

       Student_ID      Marks  Attendance
count    5.000000   5.000000    5.000000
mean     3.000000  78.800000   86.000000
std      1.581139   8.757854    8.336666
min      1.000000  69.000000   75.000000
25%      2.000000  72.000000   80.000000
50%      3.000000  78.000000   88.000000
75%      4.000000  85.000000   92.000000
max      5.000000  90.000000   95.000000

In [16]:
df_custom.to_csv("student_data.csv", index=False)

### method 4 - using mysql

In [18]:
import mysql.connector
import pandas as pd

conn = mysql.connector.connect(
    host="localhost",
    user="dsbda_user",
    password="dsbda123",
    database="dsbda"
)

df_mysql = pd.read_sql("SELECT * FROM employees", conn)
df_mysql

   emp_id   name department  salary
0       1   Aman         IT   60000
1       2  Pooja         HR   45000
2       3   Ravi    Finance   50000
3       4   Neha         IT   65000